import re

def change_date(date):
    date = re.split(r'年|月|日', date)
    year = date[0]
    month = date[1]
    day = date[2]
    year_dic = {
        '一': '1',
        '二': '2',
        '三': '3',
        '四': '4',
        '五': '5',
        '六': '6',
        '七': '7',
        '八': '8',
        '九': '9',
        '〇': '0',
    }
    month_dic = {
        '一': '1',
        '二': '2',
        '三': '3',
        '四': '4',
        '五': '5',
        '六': '6',
        '七': '7',
        '八': '8',
        '九': '9',
        '十': '10',
        '十一': '11',
        '十二': '12',
    }
    day_dic = {
        '一': '1',
        '二': '2',
        '三': '3',
        '四': '4',
        '五': '5',
        '六': '6',
        '七': '7',
        '八': '8',
        '九': '9',
        '十': '10',
        '十一': '11',
        '十二': '12',
        '十三': '13',
        '十四': '14',
        '十五': '15',
        '十六': '16',
        '十七': '17',
        '十八': '18',
        '十九': '19',
        '二十': '20',
        '二十一': '21',
        '二十二': '22',
        '二十三': '23',
        '二十四': '24',
        '二十五': '25',
        '二十六': '26',
        '二十七': '27',
        '二十八': '28',
        '二十九': '29',
        '三十': '30',
        '三十一': '31',
    }

    year_res = ''
    for one in year:
        year_res += str(year_dic[one])
    month_res = month_dic[month]
    day_res  = day_dic[day]
    return year_res+'-'+month_res+'-'+day_res


print(change_date('二〇一九年四月二十六日'))